# UNIT 33 데이터 누락 다루기

## 결측치 처리방법

### 1. 결측치 삭제

#### dropna()함수 사용
- dropna(axis = 0) : 결측치를 가진 행들을 삭제
- dropna(axis = 1) : 결측치를 가진 열들을 삭제
- dropna(how = "any") : 어떠한 결측치가 존재하면, 해당되는 행 삭제 <- default : axis = 0
- dropna(how = "all") : 모든 값들이 결측치면, 해당되는 행 삭제 <- default : axis = 0
- dropna(axis = 1, how = "all") : 모든 값들이 결측치이면, 해당되는 열 삭제
- dropna(axis = 1, how = "any"): 어떠한 결측치가 존재하면, 해당되는 열 삭제

In [16]:
import pandas as pd
import numpy as np

alco2009 = pd.read_csv("niaaa-report2009.csv", index_col="State")
s_states = [state for state in alco2009.index if state[0]=='S']+["Samoa"]
drinks = list(alco2009.columns)+["Water"]
nan_alco = alco2009.reindex(s_states, columns = drinks)
nan_alco

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa            NaN   NaN      NaN    NaN

In [24]:
# 결측치가 있는 행은 삭제하기 때문에 모든 행이 삭제 됨

nan_alco.dropna(axis=0)

Empty DataFrame
Columns: [Beer, Wine, Spirits, Water]
Index: []

In [19]:
# 결측치가 있는 열은 삭제하기때문에 모든 열이 삭제 됨

nan_alco.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [South Carolina, South Dakota, Samoa]

In [21]:
nan_alco.dropna(how="all") # default(axis=0)

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN

In [22]:
nan_alco.dropna(how = 'any')  # default(axis = 0)

Empty DataFrame
Columns: [Beer, Wine, Spirits, Water]
Index: []

In [27]:
nan_alco.dropna(how='all', axis=1)

                Beer  Wine  Spirits
State
South Carolina  1.36  0.24     0.77
South Dakota    1.53  0.22     0.88
Samoa            NaN   NaN      NaN

In [28]:
nan_alco.dropna(how='any', axis=1)

Empty DataFrame
Columns: []
Index: [South Carolina, South Dakota, Samoa]

### 2. 결측치 보정

#### isnull( ): 해당 값이 nan이면 True 반환

In [30]:
nan_alco

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa            NaN   NaN      NaN    NaN

In [32]:
nan_alco.isnull()

                 Beer   Wine  Spirits  Water
State
South Carolina  False  False    False   True
South Dakota    False  False    False   True
Samoa            True   True     True   True

#### notnull( ): 해당 값이 nan이 아니면 True 반환

In [33]:
nan_alco

                Beer  Wine  Spirits  Water
State
South Carolina  1.36  0.24     0.77    NaN
South Dakota    1.53  0.22     0.88    NaN
Samoa            NaN   NaN      NaN    NaN

In [34]:
nan_alco.notnull()

                 Beer   Wine  Spirits  Water
State
South Carolina   True   True     True  False
South Dakota     True   True     True  False
Samoa           False  False    False  False